
API_URL = "https://www.twse.com.tw/rwd/zh/announcement/auction"
YEAR_RANGE_URL = "https://www.twse.com.tw/rwd/zh/announcement/auction/auctionYear"

RENAME_COL = {
    "投標截止日": "投標結束日",
    "競拍股數": "競拍數量(張)",
    "最低每標單位(張)": "最低每標單投標數量(張)",
    "最高投(得)標單位(張)": "最高投(得)標數量(張)",
    "保證金成數": "保證金成數(%)",
    "合格投標量(張)": "合格投標數量(張)",
    "實際承銷價格(元)": "承銷價格(元)",
    "取消競價拍賣（流標或取消）": "取消競價拍賣(流標或取消)"
}

DATE_COLS = ["開標日期", "投標開始日", "投標結束日", "撥券日期(上市、上櫃日期)"]

NUMERIC_COLS = [
    '競拍數量(張)', '最低投標價格(元)', '最高投(得)標數量(張)',
    '得標總金額(元)', '總合格件', '合格投標數量(張)',
    '最低得標價格(元)', '最高得標價格(元)', '得標加權平均價格(元)'
]

INT_COLS = ['最低每標單投標數量(張)', '保證金成數(%)', '每一投標單投標處理費(元)']