
from pathlib import Path

URL_STMT = "https://mopsov.twse.com.tw/server-java/t164sb01"
URL_DOC = "https://doc.twse.com.tw/server-java/t57sb01"

HEADERS = {
    'User-Agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/120.0.0.0 Safari/537.36'
}

FALLBACK_DICT = {
    "營業收入": ["營業收入合計", "收益合計", "淨收益", "收益"],
    "本期淨利": ["母公司業主（淨利／損）", "本期稅後淨利（損）歸屬於母公司業主", "母公司業主", "母公司業主（淨利／損）", "本期淨利（淨損）", "本期淨利"],
    "每股盈餘": ["基本每股盈餘合計", "基本每股盈餘"],
    "歸屬於母公司業主之權益合計": ["歸屬於母公司業主之權益合計", "權益總計", "權益總額"],
    "已發行股份總數": ["普通股股本"],
    "負債總計": ["負債總計"],
    "資產總計": ["資產總計"]
}

SELECT_LIST = [
    '營業收入', '前一期營業收入', '本期淨利', '前一期本期淨利', '每股盈餘', '前一期每股盈餘',
    '歸屬於母公司業主之權益合計', '前一期歸屬於母公司業主之權益合計', '已發行股份總數', '前一期已發行股份總數',
    '負債總計', '前一期負債總計', '資產總計', '前一期資產總計'
]

CAL_LIST = [
    "營收成長率", "本期淨利成長率", "每股盈餘成長率", "ROE", "前一期ROE", "ROE成長率",
    "ROA", "前一期ROA", "ROA成長率", "每股淨值", "前一期每股淨值", "每股淨值成長率",
    "負債比", "前一期負債比", "負債比成長率"
]

NEW_COL = CAL_LIST + SELECT_LIST